app/views/wishes/show.html.erb

    <div class="post-content no-padding wisher">
      <% user = User.find_by(id: @wish.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]