app/views/lists/show.html.erb

SELECT  "wishes".* FROM "wishes" WHERE "wishes"."list_id" = $1 LIMIT 1  [["list_id", 1]]
---
  </div>
  <% Wish.all.where(list_id: @list.id).each do |wish| %>