app/views/users/show.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 1]]
---
  </div>
  <% List.all.where(user_id: @user.id).each do |list| %>