app/controllers/lists_controller.rb

  def show
    @user = User.find_by(id: current_user.id)
    @list = List.find_by(id: params[:format])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @list = List.new(list_params)
    @list.update(user_id: current_user.id)
    @list.save
---
INSERT INTO "lists" ("title", "user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The First List"], ["user_id", 1], ["description", "my first list"], ["created_at", "2015-06-08 00:50:26.274685"], ["updated_at", "2015-06-08 00:50:26.274685"]]

  def destroy
    @user = User.find_by(id: current_user.id)
    @list = List.find_by(id: params[:format])
    @list.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]