app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "keenansturtevant@gmail.com"]]
UPDATE "users" SET "remember_digest" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$10$xouoJrbN.utJyEhoyrkgrODidP0sn/U0DMFU4JM0zyTrDO1flOYiG"], ["id", 1]]
---
  def create
    user = User.find_by(email: params[:session][:email].downcase)
    if user && user.authenticate(params[:session][:password])
      log_in user
      user.update(login: DateTime.now)