app/controllers/static_pages_controller.rb

  def home
    wishes = Wish.where(list_id: nil)
    wishes.each do |wish|
      wish.destroy
    end
    if current_user
      @user = current_user
    else
      @user = " "
    end
    @wishes = Wish.paginate(page: params[:page], per_page: 10)
---
SELECT  "wishes".* FROM "wishes"  ORDER BY "wishes"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "wishes"