app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.update(login: DateTime.now)
    @user.update(login_count: @user.login_count += 1)


    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Keenan Sturtevant"], ["email", "keenansturtevant@gmail.com"], ["password_digest", "$2a$10$Kp5.6yNACqEUoRBz15zcSuSmBBljOMcz7akDFpdAYq9gX1GkOxY6u"]]