app/controllers/wishes_controller.rb

  def show
    @wish = Wish.find_by(id: params[:format])
    if @wish == nil
      @wish = Wish.find(params[:id])
    end
    @comment = Comment.new
    @comments = @wish.comments.all
---
SELECT  "wishes".* FROM "wishes" WHERE "wishes"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "wishes".* FROM "wishes"  ORDER BY "wishes"."id" ASC LIMIT 1 OFFSET 1

  def popular_wish
    @wishes = []
    Wish.select(:name).group(:name).having("count(*) > 1").each do |wish|
---
SELECT "wishes"."name" FROM "wishes" GROUP BY name HAVING count(*) > 1
SELECT COUNT(*) FROM "wishes"

  def new
    @wish = Wish.new
    @list = List.find_by(id: params[:format])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @user = User.find_by(id: current_user.id)
    @wish = Wish.new(wish_params)
    @wish.update(user_id: current_user.id)
    @wish.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "wishes" SET "name" = $1, "updated_at" = $2 WHERE "wishes"."id" = $3  [["name", "[Hand Crafted] HemingWeigh Natural Himalayan Hand Crafted Crystal Rock Salt Pyramid Lamp with Wood Base - - Amazon.com"], ["updated_at", "2015-06-14 14:14:58.505971"], ["id", 19]]
INSERT INTO "wishes" ("name", "list_id", "comments", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "This is it"], ["list_id", 5], ["comments", "ajsdf"], ["content", "asdf"], ["user_id", 1], ["created_at", "2015-06-08 06:33:00.233382"], ["updated_at", "2015-06-08 06:33:00.233382"]]

  def destroy
    @user = User.find_by(id: current_user.id)
    @wish = Wish.find_by(id: params[:id])
    @wish.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "wishes".* FROM "wishes" WHERE "wishes"."id" = $1 LIMIT 1  [["id", 12]]
DELETE FROM "wishes" WHERE "wishes"."id" = $1  [["id", 12]]