app/views/layouts/_catcher.html.erb

SELECT  "wishes".* FROM "wishes"  ORDER BY "wishes"."id" DESC LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
<!-- <div class="quote"> -->
  <% Wish.last.name %>
  <% user_id = Wish.last.user_id%><br>
  <small><em> <% User.find(user_id).name %></em></small>