app/views/layouts/_header_loggedout.html.erb

          <h4 class="login">
            <% offset = rand(Wish.count) %>
---
SELECT  "wishes".* FROM "wishes"  ORDER BY "wishes"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "wishes"